Revit 2026 API
BuiltInFailures.ExportFailures Class
 Failures about ExportFailures.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ExportFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class ExportFailures
Public NotInheritable Class ExportFailures
public ref class ExportFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExportFailures = class end
The BuiltInFailures.ExportFailures type exposes the following members.
Properties
Name | Description
IFCFatalExportError |  There has been an unrecoverable error during export. Export will now be aborted.
IFCFatalToolkitExportError |  There has been an unrecoverable error during export. Export will now be aborted.
IFCGenericExportWarning |  Unexpected errors occurred while exporting these elements to the IFC file.
SwitchToRasterProcessingInsteadOfVectorWarning |  Some of the views have been switched to raster processing though vector processing is selected.
Top
See Also
Reference
Autodesk.Revit.DB Namespace